In [4]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_excel(r"C:\Users\Hello\Desktop\Student_Performance_Analytics\Data\students_data.xlsx")

In [6]:
df

,Student_id,Gender,Ethnicity_Group,Parental_Education,Lunch_Type,Test_Preparation,Math_Score,Reading_Score,Writing_Score
0,0,female,group B,bachelor's degree,standard,none,72,72,74
1,1,female,group C,some college,standard,completed,69,90,88
2,2,female,group B,master's degree,standard,none,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,47,57,44
4,4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...,...
145,145,female,group C,some college,free/reduced,none,22,39,33
146,146,male,group B,some high school,standard,none,88,84,75
147,147,male,group C,associate's degree,free/reduced,none,73,68,66
148,148,female,group D,bachelor's degree,standard,completed,68,75,81
149,149,male,group A,some high school,standard,completed,62,67,69

In [7]:
df.head()

,Student_id,Gender,Ethnicity_Group,Parental_Education,Lunch_Type,Test_Preparation,Math_Score,Reading_Score,Writing_Score
0,0,female,group B,bachelor's degree,standard,none,72,72,74
1,1,female,group C,some college,standard,completed,69,90,88
2,2,female,group B,master's degree,standard,none,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,47,57,44
4,4,male,group C,some college,standard,none,76,78,75

In [8]:
df.tail()

,Student_id,Gender,Ethnicity_Group,Parental_Education,Lunch_Type,Test_Preparation,Math_Score,Reading_Score,Writing_Score
145,145,female,group C,some college,free/reduced,none,22,39,33
146,146,male,group B,some high school,standard,none,88,84,75
147,147,male,group C,associate's degree,free/reduced,none,73,68,66
148,148,female,group D,bachelor's degree,standard,completed,68,75,81
149,149,male,group A,some high school,standard,completed,62,67,69

In [9]:
df.info

<bound method DataFrame.info of      Student_id  Gender Ethnicity_Group  Parental_Education    Lunch_Type  \
0             0  female         group B   bachelor's degree      standard
1             1  female         group C        some college      standard
2             2  female         group B     master's degree      standard
3             3    male         group A  associate's degree  free/reduced
4             4    male         group C        some college      standard
..          ...     ...             ...                 ...           ...
145         145  female         group C        some college  free/reduced
146         146    male         group B    some high school      standard
147         147    male         group C  associate's degree  free/reduced
148         148  female         group D   bachelor's degree      standard
149         149    male         group A    some high school      standard

    Test_Preparation  Math_Score  Reading_Score  Writing_Score
0               none          72             72             74
1          completed          69             90             88
2               none          90             95             93
3               none          47             57             44
4               none          76             78             75
..               ...         ...            ...            ...
145             none          22             39             33
146             none          88             84             75
147             none          73             68             66
148        completed          68             75             81
149        completed          62             67             69

[150 rows x 9 columns]>

In [10]:
df.isnull().sum()

Student_id            0
Gender                0
Ethnicity_Group       0
Parental_Education    0
Lunch_Type            0
Test_Preparation      0
Math_Score            0
Reading_Score         0
Writing_Score         0
dtype: int64

In [11]:
df.columns

Index(['Student_id', 'Gender', 'Ethnicity_Group', 'Parental_Education',
       'Lunch_Type', 'Test_Preparation', 'Math_Score', 'Reading_Score',
       'Writing_Score'],
      dtype='object')

In [12]:
df=df.drop("Lunch_Type",axis=1)
df

,Student_id,Gender,Ethnicity_Group,Parental_Education,Test_Preparation,Math_Score,Reading_Score,Writing_Score
0,0,female,group B,bachelor's degree,none,72,72,74
1,1,female,group C,some college,completed,69,90,88
2,2,female,group B,master's degree,none,90,95,93
3,3,male,group A,associate's degree,none,47,57,44
4,4,male,group C,some college,none,76,78,75
...,...,...,...,...,...,...,...,...
145,145,female,group C,some college,none,22,39,33
146,146,male,group B,some high school,none,88,84,75
147,147,male,group C,associate's degree,none,73,68,66
148,148,female,group D,bachelor's degree,completed,68,75,81
149,149,male,group A,some high school,completed,62,67,69

In [13]:
df["Total_marks"] = df["Math_Score"] + df["Reading_Score"] + df["Writing_Score"]
df.head()

,Student_id,Gender,Ethnicity_Group,Parental_Education,Test_Preparation,Math_Score,Reading_Score,Writing_Score,Total_marks
0,0,female,group B,bachelor's degree,none,72,72,74,218
1,1,female,group C,some college,completed,69,90,88,247
2,2,female,group B,master's degree,none,90,95,93,278
3,3,male,group A,associate's degree,none,47,57,44,148
4,4,male,group C,some college,none,76,78,75,229

In [14]:
df["Average"] = df["Total_marks"] / 3
df.head()

,Student_id,Gender,Ethnicity_Group,Parental_Education,Test_Preparation,Math_Score,Reading_Score,Writing_Score,Total_marks,Average
0,0,female,group B,bachelor's degree,none,72,72,74,218,72.666667
1,1,female,group C,some college,completed,69,90,88,247,82.333333
2,2,female,group B,master's degree,none,90,95,93,278,92.666667
3,3,male,group A,associate's degree,none,47,57,44,148,49.333333
4,4,male,group C,some college,none,76,78,75,229,76.333333

In [15]:
def calculate_grade(avg):
    if avg >= 85:
        return "A"
    elif avg >= 70:
        return "B"
    elif avg >= 50:
        return "C"
    else:
        return "D"

df["Grade"] = df["Average"].apply(calculate_grade)
df.head()

,Student_id,Gender,Ethnicity_Group,Parental_Education,Test_Preparation,Math_Score,Reading_Score,Writing_Score,Total_marks,Average,Grade
0,0,female,group B,bachelor's degree,none,72,72,74,218,72.666667,B
1,1,female,group C,some college,completed,69,90,88,247,82.333333,B
2,2,female,group B,master's degree,none,90,95,93,278,92.666667,A
3,3,male,group A,associate's degree,none,47,57,44,148,49.333333,D
4,4,male,group C,some college,none,76,78,75,229,76.333333,B

In [16]:
df=df.drop("Ethnicity_Group",axis=1)
df

,Student_id,Gender,Parental_Education,Test_Preparation,Math_Score,Reading_Score,Writing_Score,Total_marks,Average,Grade
0,0,female,bachelor's degree,none,72,72,74,218,72.666667,B
1,1,female,some college,completed,69,90,88,247,82.333333,B
2,2,female,master's degree,none,90,95,93,278,92.666667,A
3,3,male,associate's degree,none,47,57,44,148,49.333333,D
4,4,male,some college,none,76,78,75,229,76.333333,B
...,...,...,...,...,...,...,...,...,...,...
145,145,female,some college,none,22,39,33,94,31.333333,D
146,146,male,some high school,none,88,84,75,247,82.333333,B
147,147,male,associate's degree,none,73,68,66,207,69.000000,C
148,148,female,bachelor's degree,completed,68,75,81,224,74.666667,B
149,149,male,some high school,completed,62,67,69,198,66.000000,C

In [17]:
df.columns

Index(['Student_id', 'Gender', 'Parental_Education', 'Test_Preparation',
       'Math_Score', 'Reading_Score', 'Writing_Score', 'Total_marks',
       'Average', 'Grade'],
      dtype='object')

In [18]:
# !pip install mysql-connector-python

In [19]:
import mysql.connector

# MySQl Connector
conn=mysql.connector.connect(
    host="localhost",user="root",password="lucky",database="Student_Project"
)
cursor=conn.cursor()

In [20]:
df.columns

Index(['Student_id', 'Gender', 'Parental_Education', 'Test_Preparation',
       'Math_Score', 'Reading_Score', 'Writing_Score', 'Total_marks',
       'Average', 'Grade'],
      dtype='object')

In [21]:
for row in df.itertuples(index=False):
    cursor.execute("""
        INSERT INTO Students(Student_id, Gender, Parental_Education, Test_Preparation,
       Math_Score, Reading_Score, Writing_Score, Total_marks,
       Average, Grade)
        VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
    """, row)

conn.commit()

In [22]:
cursor.close()
conn.close()